[
  "A friend and I scheduled a joint boudoir shoot with Annie during my visit to Amsterdam, and in addition to having SO MUCH fun that afternoon, the photos ended up being more breath-taking than I ever could have imagined. Annie was terrific to work with, and made us feel comfortable immediately; her cues and tips make posing easy, and her sense of what will look incredible on camera (even if not intuitive to me) is spot on. I can't stop scrolling through my photos. Thank you, Annie! — Kate Z.",

  "I worked with Annie two times and both are amazing experiences. Most of beautiful pictures on my instagram is her worked. I dont have sense/idea of how to make good pictures, but i want to have one for my social media. luckily she have the best taste in taking pictures... always love to shoot with her and never disappoint with the result. I will book her again definitely for the fall shoot! — Anna B.",

  "Annie is such a great person to work with. She really listens to what you want, gives tips and makes you feel very relaxed. Thinking 'bout doing another session with her already!!  — Agatha C.",

  "Yesterday we had an engagement photoshoot with Annie. Annie recommended us a great place, Zaanse Schans. We have never been in a photoshoot before, but Annie made the whole session really easy and fun. She helped us with the poses and her great personality made the photoshoot even better. Cannot wait to see the photos!! Highly recommended for every couple!!❤️ — Dora N.",

  "The way Annie works is authentic and simple yet so effective. The whole day was a vibe. When I first saw my photos I was GOBSMACKED!! I enjoyed every minute of the shoot and would do it again 10x over. Thank you Annie for a beautiful experience ❤️ — Amanda C.",

  "Annie is wonderful to work with! We’re not camera-natural but Annie really made us at ease. The photos turned out so well even at a time when natural light was fading away. There was nothing artificial or posed about the photos, they captured our moments. Planning around the time of the shoot and our communication were also easy. We received our photos earlier than expected. We would recommend this experience to everyone! Once again – thank you Annie!! — Karen",

  "Annie is such a great person to work with. She really listens to what you want, gives tips and makes you feel very relaxed. Thinking ‘bout doing another session with her already!! — Agatha C.",

  "Annie has a great eye for photos. She was very friendly and made me feel comfortable in front of the camera. She knows her way around Haarlem and many cool photo spots. She turned around my photos really quickly and they all turned out great. I would highly recommend this experience with Annie, especially if you travel a lot on your own, its so nice to have photos of your trip that aren’t selfies!! — Autumn",

  "I’m so happy I found Annie she is Truly an Amazing Professional Photographer and a Great person . Super sweet , funny and very easy going . I can’t say enough positive things about her. I love all my pictures . She also delivered them very quick, faster than I expected. She was amazing and super easy to work with . 100% recommend Most definitely 5 stars !!! Couldn’t be happier with the quality of work! Best service for the value! HIGHLY RECOMMENDED !! — Andreina",

  "This photo shoot with Annie was a highlight of our trip. She’s so incredibly personable and friendly and was really flexible about rescheduling when I got a nasty cold in Amsterdam. Getting to know a new unexplored city with a someone who knew all the best spots for photos and a bit of the history and culture was incredibly fun. My fiancé and I don’t just have a whole collection of gorgeous photos, but a really, really special memory of the afternoon we spent with Annie. She had excellent tips not just about locations for photos, but different poses and activities to try that made the whole experience really relaxed and so much more fun than I was expecting (as I’ve felt kind of awkward in front of the camera in the past). Annie gave us a truly unique afternoon and even had recommendations for what to do with the rest of our afternoon in Haarlem. I truly cannot recommend this experience enough! — Jessica",

  "I have never had my photos done professionally and everything about this experience is wonderful! Annie is SO kind. She walked me all over Haarlem and left me with tons of suggestions and knowledge. I highly recommend for anyone wanting to capture there time spent in this beautiful city. I’m so excited to post all my photos to Instagram lol Annie is the lady! — Betsy",

  "I must say, when I signed up for this experience, I was trying really hard to not keep my expectations high..simply because it was the first time I was trying something like this and wasn’t sure how it would turn out to be. To say that I had an Amazing time with Annie would be an understatement! Right from the time I met her, she put me at ease with her approachable attitude and friendly demeanour...I’m so awkward with any kind of posing but Annie changed that! She chatted with me throughout so that I got comfortable around her and getting photographed in general. She has such an eye for detail - we ended up using my pretty little cupcake and camera as a prop for the shoot..Annie pays a lot of attention to foreground and clicked beautiful pictures of me in the best and most picturesque spots of Amsterdam. I was absolutely thrilled after such an amazing photoshoot and when she sent me the pictures, I was jumping with excitement at how she made me look! I got tons of compliments on the pictures. Oh, and also, she is such an amazing person to hang out with..I got some very useful photography and posing tips for her and also ended up exchanging notes on Instagramming over drinks! If you’re in Amsterdam and want someone to click beautiful pictures of you, I highly recommend her! Thanks Annie for making my trip memorable :) — Saumya",

  "Annie is such a great and talented photographer! She did an amazing Job and we couldn´t be happier. From beginning i knew she is the perfect photographer and person for my planned marriage proposal. She took care of everything so that the moment was just perfect. The location, lights, position everything was adoreable. Additionally she is such a warm Person and we felt really comfortable during the shoot! She captured our real emotions perfectly. We can recommend her to everyone!!! Annie - thank you so much. - Sebastian W.",

  "Professional, friendly and creative, Annie creates a very comfortable atmosphere on the set and she is real pleasure to be around! Her innovative ideas made our photoshoot soooo fun. I was very happy with the outcome, photos were breathtaking! The quality of service was also spot on - she arrived on time, didn't mind the cold (I was freezing and we shot outside) was fully prepared and I received my photos within a few days. I can definitely recommend this lovely photographer!!! :) - Beata N.",

  "A friend and I did a shoot to celebrate our holiday together and we had SO MUCH FUN! Annie is the best, and made us feel so comfortable. Thanks you, Annie! - Liz P.",

  "A friend and I scheduled a joint boudoir shoot with Annie during my visit to Amsterdam, and in addition to having SO MUCH fun that afternoon, the photos ended up being more breath-taking than I ever could have imagined. Annie was terrific to work with, and made us feel comfortable immediately; her cues and tips make posing easy, and her sense of what will look incredible on camera (even if not intuitive to me) is spot on. I can't stop scrolling through my photos. Thank you, Annie! - Kate Z.",

  "Annie was absolutely amazing to work with. From the moment we met it felt like I was speaking with and taking pictures with an old friend- I felt that at ease! She knew exactly which locations in Amsterdam would bring about beautiful pictures and she had a wonderful vision that she was able to carry out fully. I told Annie at the end of our session that I would definitely be a recurring customer and my boyfriend and I are currently planning to schedule a couples session with her. You will absolutely not be disappointed when working with Annie- I would highly recommend her to anyone! Thank you again Annie! - Caroline H.",

  "Annie was very friendly, a great communicator, and an absolute pleasure to work with. She took beautiful photos of our engagement, which we will treasure forever. Thank you, Annie! - James C.",

  "Annie is a very talented photographer. She nailed exactly what we wanted! We are very pleased with all process, from the very first contact until the final result of our couple photoshoot. - Mariana M.",

  "Annie is such a great and talented photographer!!!! She did an amazing job and we couldn’t be happier❤️ She is such a warm person and we felt really comfortable during the shoot! She captured our real emotions perfectly! We can recommend her to everyone!!!! Thank you very much 🙏🏼🥰 - Sarah M.",

  "Annie is a great photographer and she made it so easy and natural for us! She is easy-going with kids and has a talent to capture the beauty of things around you. I would truly recommend her services! - Patrycja K."
]
